MPS/src/Catalogs/ТочкиСценарияСтарт/ТочкиСценарияСтарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияСтарт</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ЗапускПоРасписанию</name>
    <comment>Флаг запуска по расписанию, иначе - по действию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеЗапуска</name>
    <type>
      <types>CatalogRef.ВидыДействийКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитСрабатыванияНаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСрабатыванияНаКлиенте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧастотыЗапускаСценарияНаКлиенте</name>
    <type>
      <types>EnumRef.ЧастотаЗапускаСценарияНаКлиенте</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗапускаСценарияНаКлиенте</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МножПараметры</name>
    <comment>Множественные параметры действий</comment>
    <attributes>
      <name>ДействиеЗапуска</name>
      <type>
        <types>CatalogRef.ВидыДействийКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПараметров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>CatalogRef.СпискиПродуктов</types>
        <types>CatalogRef.ВидыДействийКлиента</types>
        <types>String</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.МассовыеРассылки</types>
        <types>CatalogRef.ТоварныеКатегории</types>
        <types>CatalogRef.АвтоматическиеРассылки</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыПромокодовПриРасписании</name>
    <comment>Условие выполнения расписания: Наборы, из которых доступна выдача промокода</comment>
    <attributes>
      <name>НаборПромокодов</name>
      <type>
        <types>CatalogRef.НаборыПромокодов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаличиеПродуктовВСегментеПриРасписании</name>
    <comment>Условие выполнения расписания: наличие продуктов</comment>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Enums/ЧастотаЗапускаСценарияНаКлиенте/ЧастотаЗапускаСценарияНаКлиенте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЧастотаЗапускаСценарияНаКлиенте</name>
  <enumValues>
    <name>КаждыйРаз</name>
  </enumValues>
  <enumValues>
    <name>ОдинРаз</name>
  </enumValues>
  <enumValues>
    <name>ОдинРазЗаПериод</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Enums/ЕстьНетНеВажно/ЕстьНетНеВажно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕстьНетНеВажно</name>
  <enumValues>
    <name>Есть</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>НеВажно</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ТочкиСценарияСтарт/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЗапускПоРасписаниюПриИзменении(Элемент)
	УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитСрабатыванияНаКлиентеПриИзменении(Элемент)
	Элементы.ЛимитСрабатыванияНаКлиенте.Заголовок = Склонение("раз",Объект.ЛимитСрабатыванияНаКлиенте,"Винительный");
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаЗапускаПриИзменении(Элемент)
	Элементы.ЧастотаЗапуска.Заголовок = Склонение("раз",Объект.ЧастотаЗапуска,"Винительный");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормойНаКлиенте();
	ДействияВСессии_КлиентПокинулСайтИлиПриложениеПриИзменении(Неопределено);
	ЛимитСрабатыванияНаКлиентеПриИзменении(Неопределено);
	ЧастотаЗапускаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДействияВСессии_КлиентПокинулСайтИлиПриложениеПриИзменении(Элемент)
	Если не ДействияВСессии_КлиентПокинулСайтИлиПриложение.Количество() = 0 Тогда
		Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.ПодсказкаВвода = "";
	Иначе
		Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.ПодсказкаВвода = "Любые или никаких";
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЛимитСрабатыванияНаКлиентеПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВидЧастотыЗапускаСценарияНаКлиентеПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеЗапускаПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойНаКлиенте()
	
	//смена вида запуска 
	Если Объект.ЗапускПоРасписанию Тогда
		Элементы.СтраницыРасписания.ТекущаяСтраница = Элементы.СтраницаПоРасписанию;
	Иначе	
		Элементы.СтраницыРасписания.ТекущаяСтраница = Элементы.СтраницаПоСобытию;
	КонецЕсли;
	
	//смена события
	Если Объект.ДействиеЗапуска.Пустая() Тогда
		Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы["_Страница"];
	Иначе
		Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы[ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
			Объект.ДействиеЗапуска, "ИмяПредопределенныхДанных") + "_Страница"];
	КонецЕсли;
	
	ЗапускРазВПериод = (Объект.ВидЧастотыЗапускаСценарияНаКлиенте = ПредопределенноеЗначение("Перечисление.ЧастотаЗапускаСценарияНаКлиенте.ОдинРазЗаПериод"));
	ОдинРаз = (Объект.ВидЧастотыЗапускаСценарияНаКлиенте = ПредопределенноеЗначение("Перечисление.ЧастотаЗапускаСценарияНаКлиенте.ОдинРаз"));
	
	Элементы.ГруппаПериодЗапуска.Видимость = ЗапускРазВПериод;
	Элементы.ГруппаЛимитСрабатыванияНаКлиенте.Видимость = не ОдинРаз;
	
	Элементы.ЛимитСрабатыванияНаКлиенте.Видимость = Объект.ЕстьЛимитСрабатыванияНаКлиенте;
	
КонецПроцедуры	

&НаКлиенте
Процедура СобытиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ЗначениеЗаполнено(ВыбранноеЗначение)
КонецПроцедуры

&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СВД = Справочники.ВидыДействийКлиента;
	ЭДЗ = Элементы.ДействиеЗапуска;
	
	//перечень действий
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Действия клиентов");
	ЭДЗ.СписокВыбора.Добавить(СВД.ДействиеВКампании, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПокинулСайтИлиПриложение, "Клиент покинул сайт/приложение" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.УстановкаСпискаПродуктов, "Список продуктов изменился" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ЗапрошенКодАвторизацииВОперации, "Клиент запросил код авторизации" , , БиблиотекаКартинок.Пустая);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Заказы");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеСтатусаЗаказа, "Статус заказа изменен" , , БиблиотекаКартинок.Пустая);
	
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеДанныхЗаказа, "Данные заказа изменены" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеЗаказа, "Новый заказ" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеОплачен, "Продукт в заказе оплачен" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеДоставлен,	"Продукт в заказе доставлен" , , БиблиотекаКартинок.Пустая);
	
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Сегменты");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПопалВСегмент, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентВышелИзСегмента, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);
		
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Обновление профиля клиента");
	ЭДЗ.СписокВыбора.Добавить(СВД.СтатусПодпискиИзменен,	"Статус подписки изменен" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеКлиента,	"Новый клиент" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеEmail,	"Подтверждение Email" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеEmail,	"Изменение Email" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеМобильногоТелефона,	"Подтверждение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеМобильногоТелефона,	"Изменение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РедактированиеКлиента,	"Изменение данных клиента" , , БиблиотекаКартинок.Пустая);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Изменение цены или наличия продукта");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПродуктВСписке,	"Изменился продукт в списке" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПросмотренныйПродукт,	"Изменился просмотренный продукт" , , БиблиотекаКартинок.Пустая);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Программа лояльности");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПрименилПромокод,	"Клиент применил промокод" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентуВыданПромокод,	"Клиенту выдан промокод" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеБалансаБалловПоДействию,	"Изменение баланса баллов по действию" , , БиблиотекаКартинок.Пустая);

	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Участие в рассылке");
	ЭДЗ.СписокВыбора.Добавить(СВД.ОтправкаРассылки	,	"Отправка рассылки" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеОтправлялась,	"Рассылка подготовлена, но не отправлена" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеДоставлена,	"Рассылка не доставлена" , , БиблиотекаКартинок.Пустая);
	
	Инициализация();
	
	Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы[Объект.ДействиеЗапуска.ИмяПредопределенныхДанных + "_Страница"];
	
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	СВД = Справочники.ВидыДействийКлиента;
	
	//инициализация КлиентПокинулСайтИлиПриложение
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ДобавлениеПродуктаВСписок, "Добавление продукта в список");
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ПросмотрПродуктаВОперации, "Просмотр продукта в операции");
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ПросмотрКатегорииПродуктов, "Просмотр категории продуктов");
	Если ЗаказыВСессии_КлиентПокинулСайтИлиПриложение.Пустая() ТОгда
		ЗаказыВСессии_КлиентПокинулСайтИлиПриложение = Перечисления.ЕстьНетНеВажно.НеВажно;
	КонецЕсли;	


КонецПроцедуры
